АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/алк_ДополнительныеПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ДополнительныеПараметрыПакетов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВидШпона</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>СлойДревесины</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </resources>
  <resources>
    <name>СортированныйПакет</name>
    <comment>из какого пакета была упаковка</comment>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </resources>
  <resources>
    <name>УчастокВыпуска</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </resources>
  <resources>
    <name>Досушка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Переупаковка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.алк_УпаковкаНоменклатуры</types>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
      <types>DocumentRef.алк_РучноеИзменениеПараметровПакета</types>
      <types>DocumentRef.алк_СборкаЗапасов</types>
      <types>DocumentRef.алк_Производство</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ДополнительныеПараметрыПакетов/ManagerModule.bsl
Функция ПолучитьЗначениеДополнительногоРеквизитаПакета(СерийныйНомер, НаименованиеРеквизита) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Период КАК Период,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер КАК СерийныйНомер,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.ВидШпона КАК ВидШпона,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Припуск КАК Припуск,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СлойДревесины КАК СлойДревесины,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СортированныйПакет КАК СортированныйПакет,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.УчастокВыпуска КАК УчастокВыпуска,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Досушка КАК Досушка,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Переупаковка КАК Переупаковка,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.БоковаяДоска КАК БоковаяДоска,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Документ КАК Документ,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.Габарит КАК Габарит,
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.КатегорияНоменклатурыПЭО КАК КатегорияНоменклатурыПЭО
		|ИЗ
		|	РегистрСведений.алк_ДополнительныеПараметрыПакетов.СрезПоследних КАК алк_ДополнительныеПараметрыПакетовСрезПоследних
		|ГДЕ
		|	алк_ДополнительныеПараметрыПакетовСрезПоследних.СерийныйНомер = &СерийныйНомер
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи[НаименованиеРеквизита]; 
	КонецЦикла;
	
КонецФункции  

Процедура ДобавитьЗаписьВРегистр(Структура) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьМенеджерЗаписи();  
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,Структура);
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры     
//удаление записи по документу
Процедура УдалитьЗаписьВРегистре(СерийныйНомер, Документ) Экспорт
	
	НаборЗаписей = РегистрыСведений.алк_ДополнительныеПараметрыПакетов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.СерийныйНомер.Установить(СерийныйНомер);
	
	НаборЗаписей.Прочитать(); 
	
	ЗаписиДляУдаления = Новый Массив; 
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись ИЗ НаборЗаписей Цикл 
		Если Запись.Документ = Документ Тогда 
			ЗаписиДляУдаления.Добавить(Запись);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗаписиДляУдаления.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Удаления ИЗ ЗаписиДляУдаления Цикл 
		НаборЗаписей.Удалить(Удаления);
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
